def number_to_words(n):
    n1 = {1 : 'один',
        2 : 'два', 
        3 : 'три', 
        4 : 'четыре', 
        5 : 'пять',
        6 : 'шесть', 
        7 : 'семь', 
        8 : 'восемь', 
        9 : 'девять'}
    n2 = {10 : 'десять', 
        20 : 'двадцать', 
        30 : 'тридцать', 
        40 : 'сорок',
        50 : 'пятьдесят', 
        60 : 'шестьдесят', 
        70 : 'семьдесят',
        80 : 'восемьдесят', 
        90 : 'девяносто'}
    n3 = {11 : 'одиннадцать',
        12 : 'двенадцать',
        13 : 'тринадцать',
        14 : 'четырнадцать',
        15 : 'пятнадцать',
        16 : 'шестнадцать',
        17 : 'семнадцать', 
        18 : 'восемнадцать', 
        19 : 'девятнадцать'}
    
    n_1 = n % 10
    n_2 = n - n_1

    if n < 10:
        return n1.get(n)
    elif n < 20 and n > 10:
        return n3.get(n)
    else:
        if n_1 == 0:
            return n2.get(n)
        else:
            return n2.get(n_2) + " " + n1.get(n_1)

print(number_to_words(int(input())))